# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [4]:
#Your code here; import the necessary packages
import sqlite3
import pandas as pd

In [6]:
#Your code here; create the connection and cursor
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
c = conn.cursor()

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [8]:
#Your code here; use a subquery. No join will be necessary.
c.execute("""SELECT customerNumber, contactLastName, contactFirstName
        FROM customers WHERE customerNumber in (select customerNumber from orders where orderDate = '2003-01-31')""").fetchall()

[('141', 'Freyre', 'Diego ')]

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [9]:
#Your code here
c.execute("""SELECT productName, count(distinct orderNumber) as numberOrders,
                    sum(quantityOrdered) as totalUnitsSold
                    from products
                    join orderdetails
                    using (productCode)
                    group by 1
                    order by totalUnitsSold desc;""").fetchall()

[('1992 Ferrari 360 Spider red', 53, 1808),
 ('1937 Lincoln Berline', 28, 1111),
 ('American Airlines: MD-11S', 28, 1085),
 ('1941 Chevrolet Special Deluxe Cabriolet', 28, 1076),
 ('1930 Buick Marquette Phaeton', 28, 1074),
 ('1940s Ford truck', 28, 1061),
 ('1969 Harley Davidson Ultimate Chopper', 28, 1057),
 ('1957 Chevy Pickup', 28, 1056),
 ('1964 Mercedes Tour Bus', 28, 1053),
 ('1956 Porsche 356A Coupe', 27, 1052),
 ('Corsair F4U ( Bird Cage)', 28, 1051),
 ('F/A 18 Hornet 1/72', 28, 1047),
 ('1980s Black Hawk Helicopter', 28, 1040),
 ('1913 Ford Model T Speedster', 28, 1038),
 ('1997 BMW R 1100 S', 28, 1033),
 ('1972 Alfa Romeo GTA', 28, 1030),
 ('1962 Volkswagen Microbus', 28, 1029),
 ('2002 Suzuki XREO', 28, 1028),
 ('The USS Constitution Ship', 27, 1020),
 ('2001 Ferrari Enzo', 27, 1019),
 ('1960 BSA Gold Star DBD34', 28, 1015),
 ('1997 BMW F650 ST', 28, 1014),
 ('1957 Corvette Convertible', 27, 1013),
 ('18th century schooner', 27, 1011),
 ('1900s Vintage Tri-Plane', 28, 1009),
 ('1940 Ford Pickup Truck', 28, 999),
 ('1996 Moto Guzzi 1100i', 28, 999),
 ('1926 Ford Fire Engine', 28, 998),
 ('1982 Camaro Z28', 28, 997),
 ('1939 Cadillac Limousine', 28, 995),
 ('1917 Maxwell Touring Car', 28, 992),
 ('1969 Dodge Charger', 27, 992),
 ('2002 Yamaha YZR M1', 27, 992),
 ('1912 Ford Model T Delivery Wagon', 27, 991),
 ('1904 Buick Runabout', 27, 990),
 ('1996 Peterbilt 379 Stake Bed with Outrigger', 28, 988),
 ('1998 Chrysler Plymouth Prowler', 28, 986),
 ('1934 Ford V8 Coupe', 28, 985),
 ('2003 Harley-Davidson Eagle Drag Bike', 28, 985),
 ('America West Airlines B757-200', 28, 984),
 ('1936 Chrysler Airflow', 28, 983),
 ('1958 Chevy Corvette Limited Edition', 28, 983),
 ('Diamond T620 Semi-Skirted Tanker', 28, 979),
 ('1970 Dodge Coronet', 28, 976),
 ('1969 Dodge Super Bee', 27, 974),
 ('ATA: B757-300', 28, 973),
 ('1928 British Royal Navy Airplane', 28, 972),
 ('1928 Ford Phaeton Deluxe', 28, 972),
 ('1948 Porsche 356-A Roadster', 27, 972),
 ('1958 Setra Bus', 28, 972),
 ('1971 Alpine Renault 1600s', 27, 969),
 ('1962 City of Detroit Streetcar', 27, 966),
 ('1999 Yamaha Speed Boat', 28, 966),
 ('1969 Ford Falcon', 27, 965),
 ('1969 Corvair Monza', 27, 963),
 ('1952 Alpine Renault 1300', 28, 961),
 ('1936 Mercedes-Benz 500K Special Roadster', 28, 960),
 ('Boeing X-32A JSF', 28, 960),
 ('1957 Vespa GS150', 27, 959),
 ('Pont Yacht', 27, 958),
 ('1932 Model A Ford J-Coupe', 28, 957),
 ('1938 Cadillac V-16 Presidential Limousine', 28, 955),
 ('1954 Greyhound Scenicruiser', 28, 955),
 ('The Titanic', 27, 952),
 ('1949 Jaguar XK 120', 25, 949),
 ('1948 Porsche Type 356 Roadster', 25, 948),
 ('1982 Ducati 900 Monster', 27, 947),
 ('1993 Mazda RX-7', 27, 947),
 ('1936 Harley Davidson El Knucklehead', 28, 945),
 ('1970 Triumph Spitfire', 27, 945),
 ('1961 Chevrolet Impala', 27, 941),
 ('1900s Vintage Bi-Plane', 28, 940),
 ('1939 Chevrolet Deluxe Coupe', 28, 937),
 ("1950's Chicago Surface Lines Streetcar", 27, 934),
 ('The Schooner Bluenose', 27, 934),
 ('1968 Ford Mustang', 27, 933),
 ('1962 LanciaA Delta 16V', 28, 932),
 ('1968 Dodge Charger', 27, 925),
 ('1940 Ford Delivery Sedan', 28, 923),
 ('1917 Grand Touring Sedan', 25, 918),
 ('Collectable Wooden Train', 27, 918),
 ('1995 Honda Civic', 27, 917),
 ('P-51-D Mustang', 28, 917),
 ('1966 Shelby Cobra 427 S/C', 25, 915),
 ('1976 Ford Gran Torino', 27, 915),
 ('1965 Aston Martin DB5', 25, 914),
 ('1982 Lamborghini Diablo', 27, 912),
 ('1980â€™s GM Manhattan Express', 28, 911),
 ('18th Century Vintage Horse Carriage', 28, 907),
 ('1982 Ducati 996 R', 27, 906),
 ('1970 Plymouth Hemi Cuda', 27, 900),
 ('1974 Ducati 350 Mk3 Desmo', 27, 898),
 ('The Mayflower', 27, 898),
 ('HMS Bounty', 28, 897),
 ('The Queen Mary', 27, 896),
 ('2002 Chevy Corvette', 25, 894),
 ('American Airlines: B767-300', 28, 894),
 ('1937 Horch 930V Limousine', 28, 884),
 ('1903 Ford Model A', 27, 883),
 ('1928 Mercedes-Benz SSK', 28, 880),
 ('1952 Citroen-15CV', 24, 873),
 ('1969 Chevrolet Camaro Z28', 25, 870),
 ('1992 Porsche Cayenne Turbo Silver', 27, 867),
 ('1932 Alfa Romeo 8C2300 Spider Sport', 25, 866),
 ('1999 Indy 500 Monte Carlo SS', 25, 855),
 ('1911 Ford Town Car', 25, 832),
 ('1936 Mercedes Benz 500k Roadster', 25, 824),
 ('1970 Chevy Chevelle SS 454', 25, 803),
 ('1957 Ford Thunderbird', 24, 767)]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [ ]:
#Your code here

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
#Your code here

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!